nc: 12  # Camvid数据集12个类别
depth_multiple: 1.0  # 模型深度倍数（1.0=原始ResNet50深度）
width_multiple: 1.0  # 通道宽度倍数（1.0=原始通道数）

# 语义分割无需锚框，删除检测任务的anchors配置

backbone:
  # [from, number, module, args]
  # args格式：[out_channels, num_blocks, stride]（in_channels由from自动推导）
  [[-1, 1, ResNetStem, [64]],                   # 0: 64通道, 320x320 (640/2)
   [-1, 1, ResNet50Layer, [256, 3, 1]],       # 1: 256通道, 320x320 (3个瓶颈块, 步长1)
   [-1, 1, ResNet50Layer, [512, 4, 2]],       # 2: 512通道, 160x160 (4个瓶颈块, 步长2, 尺寸减半)
   [-1, 1, ResNet50Layer, [1024, 6, 2]],      # 3: 1024通道, 80x80 (6个瓶颈块, 步长2, 尺寸减半)
   [-1, 1, ResNet50Layer, [2048, 3, 2]],      # 4: 2048通道, 40x40 (3个瓶颈块, 步长2, 尺寸减半)
  ]

head:
  [
    # 第1次上采样：融合1/16 → 1/8尺度
    [-1, 1, Conv, [512, 1, 1]],                # 0: 降维至512（来自SPPF的1024通道）
    [-1, 1, Upsample, [None, 2, 'nearest']],   # 1: 上采样至1/8尺度（512通道）
    [2, 1, Conv, [512, 1, 1]],                 # 2: 从backbone第2层（256通道）升维至512
    [[-1, -2], 1, Concat, [1]],                # 3: 拼接第2层（512）和第1层（512）→ 1024通道（关键修正：用-2指向第1层）
    [-1, 3, C3, [512, False]],                 # 4: 融合后512通道
    
    # 第2次上采样：融合1/8 → 1/4尺度
    [-1, 1, Conv, [256, 1, 1]],                # 5: 降维至256
    [-1, 1, Upsample, [None, 2, 'nearest']],   # 6: 上采样至1/4尺度（256通道）
    [1, 1, Conv, [256, 1, 1]],                 # 7: 从backbone第1层（128通道）升维至256
    [[-1, -2], 1, Concat, [1]],                # 8: 拼接第7层（256）和第6层（256）→ 512通道（修正：用-2指向第6层）
    [-1, 3, C3, [256, False]],                 # 9: 融合后256通道
    
    # 第3次上采样：融合1/4 → 1/2尺度
    [-1, 1, Conv, [128, 1, 1]],                # 10: 降维至128
    [-1, 1, Upsample, [None, 2, 'nearest']],   # 11: 上采样至1/2尺度（128通道）
    [0, 1, Conv, [128, 1, 1]],                 # 12: 从backbone第0层（64通道）升维至128
    [[-1, -2], 1, Concat, [1]],                # 13: 拼接第12层（128）和第11层（128）→ 256通道（修正：用-2指向第11层）
    [-1, 3, C3, [128, False]],                 # 14: 融合后128通道
    
    # 最终上采样至输入尺寸
    [-1, 1, Conv, [64, 3, 1]],                 # 15: 细化特征
    [-1, 1, Upsample, [None, 2, 'nearest']],   # 16: 恢复至输入尺寸
    [-1, 1, Conv, [12, 1, 1]],                 # 17: 12通道输出
    [-1, 1, nn.Softmax, [1]],                  # 18: 通道维度softmax
  ]
    