nc: 12  # Camvid数据集12个类别
depth_multiple: 1.0  # 模型深度倍数（1.0=原始ResNet18深度）
width_multiple: 1.0  # 通道宽度倍数（1.0=原始通道数）

backbone:
  # [from, number, module, args]
  # args格式：[out_channels, num_blocks, stride]（in_channels由from自动推导）
  [[-1, 1, ResNetStem, [64]],                 # 0: 64通道, 320x320 (640/2)
   [-1, 1, ResNet18Layer, [64, 2, 1]],        # 1: 64通道, 320x320 (2个基本块, 步长1)
   [-1, 1, ResNet18Layer, [128, 2, 2]],       # 2: 128通道, 160x160 (2个基本块, 步长2, 尺寸减半)
   [-1, 1, ResNet18Layer, [256, 2, 2]],       # 3: 256通道, 80x80 (2个基本块, 步长2, 尺寸减半)
   [-1, 1, ResNet18Layer, [512, 2, 2]],       # 4: 512通道, 40x40 (2个基本块, 步长2, 尺寸减半)
  ]

head:
  # [from, number, module, args]
  [[-1, 1, Conv, [512, 256, 1, 1]],           # 5: 256通道, 40x40 (降维)
   [-1, 1, SPPF, [256, 256, 5]],              # 6: 256通道, 40x40 (增强感受野)
   
   # 第一次上采样融合 (40x40 → 80x80)
   [-1, 1, Conv, [256, 128, 1, 1]],           # 7: 128通道, 40x40
   [-1, 1, Upsample, [None, 2, 'nearest']],   # 8: 128通道, 80x80 (上采样2倍)
   [3, 1, Conv, [256, 128, 1, 1]],            # 9: 128通道, 80x80 (调整backbone第3层特征)
   [[-1, 8], 1, Concat, [1]],                 # 10: 256通道, 80x80 (融合特征)
   [-1, 2, C3, [256, 256, False]],            # 11: 256通道, 80x80 (特征融合)
   
   # 第二次上采样融合 (80x80 → 160x160)
   [-1, 1, Conv, [256, 64, 1, 1]],            # 12: 64通道, 80x80
   [-1, 1, Upsample, [None, 2, 'nearest']],   # 13: 64通道, 160x160 (上采样2倍)
   [2, 1, Conv, [128, 64, 1, 1]],             # 14: 64通道, 160x160 (调整backbone第2层特征)
   [[-1, 13], 1, Concat, [1]],                # 15: 128通道, 160x160 (融合特征)
   [-1, 2, C3, [128, 128, False]],            # 16: 128通道, 160x160 (特征融合)
   
   # 第三次上采样融合 (160x160 → 320x320)
   [-1, 1, Conv, [128, 32, 1, 1]],            # 17: 32通道, 160x160
   [-1, 1, Upsample, [None, 2, 'nearest']],   # 18: 32通道, 320x320 (上采样2倍)
   [1, 1, Conv, [64, 32, 1, 1]],              # 19: 32通道, 320x320 (调整backbone第1层特征)
   [[-1, 18], 1, Concat, [1]],                # 20: 64通道, 320x320 (融合特征)
   [-1, 2, C3, [64, 64, False]],              # 21: 64通道, 320x320 (特征融合)
   
   # 最终上采样至输入尺寸 (320x320 → 640x640)
   [-1, 1, Conv, [64, 32, 3, 1]],             # 22: 32通道, 320x320 (细化特征)
   [-1, 1, Upsample, [None, 2, 'nearest']],   # 23: 32通道, 640x640 (匹配输入尺寸)
   
   # 输出层 (12类语义分割)
   [-1, 1, Conv, [32, nc, 1, 1]],             # 24: 12通道, 640x640 (每个通道对应一类)
   [-1, 1, nn.Softmax, [1]],                  # 25: 对通道维度做softmax, 输出类别概率
  ]
    