# YOLOv9 语义分割模型配置文件
# 基于CSPNetv2和全局聚合模块(GAM)的编码器-解码器结构

# 模型参数
nc: 12  # CamVid数据集类别数
depth_multiple: 1.0  # 深度因子（控制模型深度）
width_multiple: 1.0  # 宽度因子（控制通道数）

# 主干网络（编码器）- 使用C3k2和GAM模块
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 3, 2]],  # 0-P1/2
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4
   [-1, 3, C3k2, [128]],        # 2
   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8
   [-1, 6, C3k2, [256]],        # 4
   [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16
   [-1, 6, C3k2, [512]],        # 6
   [-1, 1, Conv, [1024, 3, 2]], # 7-P5/32
   [-1, 3, C3k2, [1024]],       # 8
   [-1, 1, GAM, [1024]],        # 9-全局聚合模块
   [-1, 1, SPPF, [1024, 5]],    # 10
  ]

# 分割头（解码器）- 上采样+特征融合
head:
  [[-1, 1, Conv, [512, 1, 1]],                  # 11
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  # 12
   [[-1, 6], 1, Concat, [1]],                   # 13-与第6层特征融合
   [-1, 3, C3k2, [512, False]],                 # 14
   
   [-1, 1, Conv, [256, 1, 1]],                  # 15
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  # 16
   [[-1, 4], 1, Concat, [1]],                   # 17-与第4层特征融合
   [-1, 3, C3k2, [256, False]],                 # 18
   
   [-1, 1, Conv, [128, 1, 1]],                  # 19
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  # 20
   [[-1, 2], 1, Concat, [1]],                   # 21-与第2层特征融合
   [-1, 3, C3k2, [128, False]],                 # 22
   
   [-1, 1, Conv, [128, 3, 1]],                  # 23
   [-1, 1, GAM, [128]],                         # 24-全局聚合模块
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  # 25-P2/4
   
   [-1, 1, Conv, [nc, 1, 1]],                   # 26-输出层（类别数）
  ]
    