# 统一参数（与VGG16和ResNet50版本保持一致）
nc: 12  # CamVid数据集12类
depth_multiple: 1.0  # 保持原始深度（无缩放）
width_multiple: 1.0  # 保持原始通道（无缩放）
# 移除anchors（语义分割无需锚框）


# -------------------------- YOLOv8 原始backbone（使用C2f模块替代C3） --------------------------
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 3, 2, 1]],  # 0-P1/2
   [-1, 1, Conv, [128, 3, 2]],    # 1-P2/4
   [-1, 3, C2f, [128, True]],     # 2 (YOLOv8使用C2f替代C3)
   [-1, 1, Conv, [256, 3, 2]],    # 3-P3/8
   [-1, 6, C2f_DCN, [256, True]], # 4 (带DCN的C2f模块)
   [-1, 1, Conv, [512, 3, 2]],    # 5-P4/16
   [-1, 6, C2f_DCN, [512, True]], # 6 (带DCN的C2f模块)
   [-1, 1, Conv, [1024, 3, 2]],   # 7-P5/32
   [-1, 3, C2f_DCN, [1024, True]],# 8 (带DCN的C2f模块)
   [-1, 1, SPPF, [1024, 5]],      # 9
  ]


# -------------------------- 统一分割头（与其他backbone版本完全一致） --------------------------
head:
  # 第1次上采样：1/32 → 1/16尺度（融合backbone第6层特征）
  [[-1, 1, Conv, [512, 1, 1]],                # 0: 1024→512降维
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], # 1: 上采样2倍（1/16尺度）
   [6, 1, Conv, [512, 1, 1]],                 # 2: backbone第6层（512通道）→512（保持通道一致）
   [[-1, 1], 1, Concat, [1]],                  # 3: 拼接（512+512=1024通道）
   [-1, 3, C2f, [512, False]],                # 4: 特征融合（1024→512通道，使用C2f替代C3）
   
   # 第2次上采样：1/16 → 1/8尺度（融合backbone第4层特征）
   [-1, 1, Conv, [256, 1, 1]],                # 5: 512→256降维
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], # 6: 上采样2倍（1/8尺度）
   [4, 1, Conv, [256, 1, 1]],                 # 7: backbone第4层（256通道）→256（保持通道一致）
   [[-1, 6], 1, Concat, [1]],                  # 8: 拼接（256+256=512通道）
   [-1, 3, C2f, [256, False]],                # 9: 特征融合（512→256通道，使用C2f替代C3）
   
   # 第3次上采样：1/8 → 1/4尺度（融合backbone第2层特征）
   [-1, 1, Conv, [128, 1, 1]],                # 10: 256→128降维
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], # 11: 上采样2倍（1/4尺度）
   [2, 1, Conv, [128, 1, 1]],                 # 12: backbone第2层（128通道）→128（保持通道一致）
   [[-1, 11], 1, Concat, [1]],                 # 13: 拼接（128+128=256通道）
   [-1, 3, C2f, [128, False]],                # 14: 特征融合（256→128通道，使用C2f替代C3）
   
   # 最终上采样：1/4 → 输入尺寸（640x640）
   [-1, 1, Conv, [64, 3, 1]],                 # 15: 128→64通道（3x3卷积细化特征）
   [-1, 1, nn.Upsample, [None, 4, 'nearest']], # 16: 上采样4倍（640x640，匹配输入尺寸）
   [-1, 1, Conv, [12, 1, 1]],                 # 17: 64→12通道（输出12类分割结果）
   [-1, 1, nn.Softmax, [1]],                  # 18: 通道维度Softmax（输出类别概率）
  ]
