# YOLOv9 语义分割配置 (适配ResNet50风格head)
# 针对CamVid 12类，保持与ResNet50 head的通道对齐

# 模型参数
nc: 12  # CamVid数据集类别数
depth_multiple: 1.0  # 深度因子（与ResNet50保持一致）
width_multiple: 1.0  # 宽度因子（确保通道数严格匹配）

# Backbone（编码器）- 调整通道数适配ResNet50风格head
backbone:
  [[-1, 1, Conv, [64, 3, 2]],    # 0-P1/2（64通道，与head第12层匹配）
   [-1, 1, Conv, [128, 3, 2]],   # 1-P2/4
   [-1, 2, C3k2, [128]],         # 2-P2/4（128通道，与head第7层匹配）
   [-1, 1, Conv, [256, 3, 2]],   # 3-P3/8
   [-1, 2, C3k2, [256]],         # 4-P3/8（256通道，与head第2层匹配）
   [-1, 1, Conv, [512, 3, 2]],   # 5-P4/16
   [-1, 3, C3k2, [512]],         # 6-P4/16
   [-1, 1, C3k2, [512]],         # 7-P4/16
   [-1, 1, C3k2, [512]],         # 8-P4/16（加深网络以匹配ResNet50深度）
   [-1, 1, GAM, [512]],          # 9-P4/16（注意力增强）
   [-1, 1, SPPF, [1024, 5]],     # 10-P4/16（1024通道，与head第0层匹配）
  ]

# Head（解码器）- 保持与ResNet50 head完全一致
head:
  [
    # 第1次上采样：融合1/16 → 1/8尺度
    [-1, 1, Conv, [512, 1, 1]],                # 0: 降维至512（来自backbone第10层的1024通道）
    [-1, 1, Upsample, [None, 2, 'nearest']],   # 1: 上采样至1/8尺度（80x80）
    [4, 1, Conv, [512, 1, 1]],                 # 2: 从backbone第4层（256通道）升维至512（1/8尺度）
    [[-1, -2], 1, Concat, [1]],                # 3: 拼接（512+512=1024通道）
    [-1, 3, C3, [512, False]],                 # 4: 融合后512通道
    
    # 第2次上采样：融合1/8 → 1/4尺度
    [-1, 1, Conv, [256, 1, 1]],                # 5: 降维至256
    [-1, 1, Upsample, [None, 2, 'nearest']],   # 6: 上采样至1/4尺度（160x160）
    [2, 1, Conv, [256, 1, 1]],                 # 7: 从backbone第2层（128通道）升维至256（1/4尺度）
    [[-1, -2], 1, Concat, [1]],                # 8: 拼接（256+256=512通道）
    [-1, 3, C3, [256, False]],                 # 9: 融合后256通道
    
    # 第3次上采样：融合1/4 → 1/2尺度
    [-1, 1, Conv, [128, 1, 1]],                # 10: 降维至128
    [-1, 1, Upsample, [None, 2, 'nearest']],   # 11: 上采样至1/2尺度（320x320）
    [0, 1, Conv, [128, 1, 1]],                 # 12: 从backbone第0层（64通道）升维至128（1/2尺度）
    [[-1, -2], 1, Concat, [1]],                # 13: 拼接（128+128=256通道）
    [-1, 3, C3, [128, False]],                 # 14: 融合后128通道
    
    # 最终上采样至输入尺寸
    [-1, 1, Conv, [64, 3, 1]],                 # 15: 细化特征
    [-1, 1, Upsample, [None, 2, 'nearest']],   # 16: 恢复至输入尺寸（640x640）
    [-1, 1, Conv, [12, 1, 1]],                 # 17: 12通道输出
    [-1, 1, nn.Softmax, [1]],                  # 18: 通道维度softmax（注意：语义分割通常在损失函数中处理softmax）
  ]
