# 统一参数（与VGG16和ResNet50版本保持一致）
nc: 12  # CamVid数据集12类
depth_multiple: 1.0  # 保持原始深度（无缩放）
width_multiple: 1.0  # 保持原始通道（无缩放）
# 移除anchors（语义分割无需锚框）



backbone:
    [
      [-1, 1, Conv, [64, 3, 2, 1]],   # 0: 64通道, 320x320 (1/2尺度)
      [-1, 1, Conv, [128, 3, 2]],     # 1: 128通道, 160x160 (1/4尺度)
      [-1, 3, C2f, [128, True]],      # 2: 128通道, 160x160 (1/4尺度)
      [-1, 1, Conv, [256, 3, 2]],     # 3: 256通道, 80x80 (1/8尺度)
      [-1, 6, C2f_DCN, [256, True]],  # 4: 256通道, 80x80 (1/8尺度)
      [-1, 1, Conv, [512, 3, 2]],     # 5: 512通道, 40x40 (1/16尺度)
      [-1, 6, C2f_DCN, [512, True]],  # 6: 512通道, 40x40 (1/16尺度)
      [-1, 1, Conv, [1024, 3, 2]],    # 7: 1024通道, 20x20 (1/32尺度)
      [-1, 3, C2f_DCN, [1024, True]], # 8: 1024通道, 20x20 (1/32尺度)
      [-1, 1, SPPF, [1024, 5]],       # 9: 1024通道, 20x20 (与ResNet50保持SPPF功能一致)
      [-1, 1, Upsample, [None, 2, 'nearest']], # 10: 1024通道, 40x40 (统一至1/16尺度，与ResNet50匹配)
    ]
  
head:  # 与ResNet50的head完全相同（层结构、通道数、连接方式完全一致）
    [
      # 第1次上采样：融合1/16 → 1/8尺度
      [-1, 1, Conv, [512, 1, 1]],                # 0: 降维至512（来自backbone第10层的1024通道）
      [-1, 1, Upsample, [None, 2, 'nearest']],   # 1: 上采样至1/8尺度（80x80）
      [4, 1, Conv, [512, 1, 1]],                 # 2: 从backbone第4层（256通道）升维至512（1/8尺度）
      [[-1, -2], 1, Concat, [1]],                # 3: 拼接（512+512=1024通道）
      [-1, 3, C3, [512, False]],                 # 4: 融合后512通道
      
      # 第2次上采样：融合1/8 → 1/4尺度
      [-1, 1, Conv, [256, 1, 1]],                # 5: 降维至256
      [-1, 1, Upsample, [None, 2, 'nearest']],   # 6: 上采样至1/4尺度（160x160）
      [2, 1, Conv, [256, 1, 1]],                 # 7: 从backbone第2层（128通道）升维至256（1/4尺度）
      [[-1, -2], 1, Concat, [1]],                # 8: 拼接（256+256=512通道）
      [-1, 3, C3, [256, False]],                 # 9: 融合后256通道
      
      # 第3次上采样：融合1/4 → 1/2尺度
      [-1, 1, Conv, [128, 1, 1]],                # 10: 降维至128
      [-1, 1, Upsample, [None, 2, 'nearest']],   # 11: 上采样至1/2尺度（320x320）
      [0, 1, Conv, [128, 1, 1]],                 # 12: 从backbone第0层（64通道）升维至128（1/2尺度）
      [[-1, -2], 1, Concat, [1]],                # 13: 拼接（128+128=256通道）
      [-1, 3, C3, [128, False]],                 # 14: 融合后128通道
      
      # 最终上采样至输入尺寸
      [-1, 1, Conv, [64, 3, 1]],                 # 15: 细化特征
      [-1, 1, Upsample, [None, 2, 'nearest']],   # 16: 恢复至输入尺寸（640x640）
      [-1, 1, Conv, [12, 1, 1]],                 # 17: 12通道输出
      [-1, 1, nn.Softmax, [1]],                  # 18: 通道维度softmax
    ]
    