nc: 12  # Camvid数据集12个类别
depth_multiple: 1.0  # 模型深度倍数（1.0=原始ResNet50深度）
width_multiple: 1.0  # 通道宽度倍数（1.0=原始通道数）

# 语义分割无需锚框，删除检测任务的anchors配置

backbone:
  # [from, number, module, args]
  # args格式：[out_channels, num_blocks, stride]（in_channels由from自动推导）
  [[-1, 1, ResNetStem, []],                   # 0: 64通道, 320x320 (640/2)
   [-1, 1, ResNet50Layer, [256, 3, 1]],       # 1: 256通道, 320x320 (3个瓶颈块, 步长1)
   [-1, 1, ResNet50Layer, [512, 4, 2]],       # 2: 512通道, 160x160 (4个瓶颈块, 步长2, 尺寸减半)
   [-1, 1, ResNet50Layer, [1024, 6, 2]],      # 3: 1024通道, 80x80 (6个瓶颈块, 步长2, 尺寸减半)
   [-1, 1, ResNet50Layer, [2048, 3, 2]],      # 4: 2048通道, 40x40 (3个瓶颈块, 步长2, 尺寸减半)
  ]

head:
  # [from, number, module, args]
  [[-1, 1, Conv, [1024, 1, 1]],               # 5: 1024通道, 40x40 (降维)
   [-1, 1, SPPF, [1024, 5]],                  # 6: 1024通道, 40x40 (增强感受野)
   
   # 第一次上采样融合 (40x40 → 80x80)
   [-1, 1, Conv, [512, 1, 1]],                # 7: 512通道, 40x40
   [-1, 1, Upsample, [None, 2, 'nearest']],   # 8: 512通道, 80x80 (上采样2倍)
   [3, 1, Conv, [512, 1, 1]],                 # 9: 512通道, 80x80 (调整backbone第3层特征)
   [[-1, 8], 1, Concat, [1]],                 # 10: 1024通道, 80x80 (融合特征)
   [-1, 3, C3, [512, False]],                 # 11: 512通道, 80x80 (特征融合)
   
   # 第二次上采样融合 (80x80 → 160x160)
   [-1, 1, Conv, [256, 1, 1]],                # 12: 256通道, 80x80
   [-1, 1, Upsample, [None, 2, 'nearest']],   # 13: 256通道, 160x160 (上采样2倍)
   [2, 1, Conv, [256, 1, 1]],                 # 14: 256通道, 160x160 (调整backbone第2层特征)
   [[-1, 13], 1, Concat, [1]],                # 15: 512通道, 160x160 (融合特征)
   [-1, 3, C3, [256, False]],                 # 16: 256通道, 160x160 (特征融合)
   
   # 第三次上采样融合 (160x160 → 320x320)
   [-1, 1, Conv, [128, 1, 1]],                # 17: 128通道, 160x160
   [-1, 1, Upsample, [None, 2, 'nearest']],   # 18: 128通道, 320x320 (上采样2倍)
   [1, 1, Conv, [128, 1, 1]],                 # 19: 128通道, 320x320 (调整backbone第1层特征)
   [[-1, 18], 1, Concat, [1]],                # 20: 256通道, 320x320 (融合特征)
   [-1, 3, C3, [128, False]],                 # 21: 128通道, 320x320 (特征融合)
   
   # 最终上采样至输入尺寸 (320x320 → 640x640)
   [-1, 1, Conv, [64, 3, 1]],                 # 22: 64通道, 320x320 (细化特征)
   [-1, 1, Upsample, [None, 2, 'nearest']],   # 23: 64通道, 640x640 (匹配输入尺寸)
   
   # 输出层 (12类语义分割)
   [-1, 1, Conv, [nc, 1, 1]],                 # 24: 12通道, 640x640 (每个通道对应一类)
   [-1, 1, nn.Softmax, [1]],                  # 25: 对通道维度做softmax, 输出类别概率
  ]
